def is_prime(func):  # определение декоратора
    def prime():  # определение внутренней функции декоратора
        av = func  # присвоение переменной результата выполнения функции
        for i in range(2, (av // 2) + 1):
            if av % i == 0:
                return str(av) + '\nСоставное'
        return str(av) + '\nПростое'

    return prime()  # взврат внутренней функции


# @is_prime  # не срабатывающая конструкция
def sum_three(a, b, c):  # определение функции
    return a + b + c


# ТЕСТ ----------------------------------------------------------------------------------------------------------------

nt = is_prime(sum_three(1, 2, 3))
# nt = sum_three(1,2,3)  # не срабатывающая конструкция
print(nt)
